Reports/Прогноз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Прогноз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Все</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тур</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Прогноз/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
	
	График.Очистить();
	Для Каждого ТекСтрока Из Отчет.Данные Цикл
		График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.Тур), ТекСтрока.КоличествоОчков);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧемпионатыЗагрузить();
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузить()
	Чемпионаты.ЗагрузитьЗначения(СерверныйФункции.ЧемпионатыТекущие(Истина));
КонецПроцедуры
